constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       18130;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       18170;
    }
    nozzleWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          230;
        startFace       18210;
    }
    axis
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          230;
        startFace       18440;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          18400;
        startFace       18670;
    }
)

// ************************************************************************* //
