0/p
/*--------------------------------*- C++ -*-----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 50000;

boundaryField
{
    inlet
{
    type            totalPressure;
    p0              uniform 500000;
    U               U;
    phi             phi;
    rho             rho;
    psi             thermo:psi;
    gamma           1.4;
    value           uniform 500000;
}
    outlet
    {
        type            fixedValue;
        value           uniform 50000;
    }
    nozzleWall
    {
        type            zeroGradient;
    }
    axis
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}
