0/rho
/*--------------------------------*- C++ -*-----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 2.9;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 2.9;
    }
    outlet
    {
        type            zeroGradient;
    }
    nozzleWall
    {
        type            zeroGradient;
    }
    axis
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}
